package com.journal.start;

import com.journal.exeption.IncorrectInputException;
import com.journal.model.Person;
import com.journal.model.Student;
import com.journal.model.Teacher;
import com.journal.validator.Validador;

import java.util.Random;

public class RandomPerson {
    public static Person randomPerson(){
        Random random = new Random();

        String nameM[] = {"Олександр", "Андрій", "Богдан", "Микита", "Трофім ", "Захар", "Матвій", "Гнат", "Полікарп", "Савелій",
                "Тарас", "Матвій", "Петро", "​​Іполит", "Валерій", "Давид", "Артем", "Дамір", "Данило", "Кирило", "Марк", "Матвій",
                "Михайло", "Святослав", "Вадим", "Ігор", "Юрій", "Ярослав", "Святослав", "Олесь", "Валентин", "Мирослав", "Петро",
                "Ян", "Філіп", "Григорій", "Борис", "Михайло", "Олексій", "Ілля", "Володимир", "Микола"};

        String nameF[] = {"Маргарита", "Дарина", "Аріна", "Христина", "Валерія", "Руслана", "Карина", "Рита", "Вероніка",
                "Вікторія", "Августина", "Аврора", "Агафія", "Аліна", "Алла", "Гертруда", "Діана", "Інеса", "Ірина",
                "Ірма", "Констанція", "Марія", "Надія", "Ніка", "Світлана", "Соломія", "Софія", "Тереза", "Фріда", "Ельвіра",
                "Агнія", "Зара", "Серафима", "Євгенія", "Ольга", "Єлизавета", "Катерина", "Олена", "Дарина", "Анна", "Олеся",
                "Ангеліна", "Уляна", "Єва", "Анастасія", "Ірина", "Христина", "Тетяна", "Марина", "Ангеліна", "Світлана", "Аліса",
                "Кіра", "Анастасія", "Марина", "Діана", "Карина", "Вероніка", "Олена", "Наталя", "Поліна", "Ксенія", "Юлія",
                "Надія", "Аліса", "Вікторія", "Яна", "Людмила", "Василина", "Марія"};

        String nameS[] = {"Бебешко", "Безручко", "Бойко", "Ботярко", "Брунько", "Валько", "Гомілко", "Данилко", "Забужко",
                "Зленко", "Зрайко", "Зубко", "Кличко", "Лешко", "Лиско", "Ляшко", "Максімко", "Маціборко", "Мицко", "Мрічко",
                "Наливайко", "Настобурко", "Остроушко", "Панько", "Перев'язко", "Перетятько", "Полатайко", "Половко",
                "Портянко", "Прилипко", "Приходько", "Ріжко", "Сірко", "Завойко", "Соломко", "Стинавко", "Сухоручко",
                "Сушко", "Титко", "Федушко", "Фучко", "Фуфалько", "Ховавко", "Хорошко", "Хомко", "Храпко", "Цушко",
                "Цьомко", "Чуйко", "Шайко", "Шляхетко", "Шумейко", "Шпитко", "Ямборко", "Янко", "Бабенко", "Бондаренко",
                "Василенко", "Вдовиченко", "Гончаренко", "Григоренко", "Гриценко", "Даниленко", "Діденко", "Дем'яненко",
                "Зінченко", "Іваненко", "Капітаненко", "Капітоненко", "Кириленко", "Клименко", "Коваленко", "Козубенко",
                "Косенко", "Лук'яненко", "Луценко", "Малаєнко", "Огієнко", "Павленко", "Панченко", "Пархоменко",
                "Петренко", "Посвятенко", "Потапенко", "Савчегко", "Саєнко", "Сергієнко", "Симоненко", "Тарасенко",
                "Титаренко", "Тимошенко", "Ткаченко", "Шевченко", "Юрченко", "Ярмоленко", "Витребенько", "Вишенько",
                "Кренько", "Опенько", "Потебенько", "Боєчко", "Величко", "Гричка", "Іваночко", "Леочко", "Марочко",
                "Семочко", "Толочко", "Юречко", "Арич", "Демич", "Дімнич", "Зварич", "Зінич", "Катрич", "Кузьмич",
                "Марич", "Місярич", "Негрич", "Попадич", "Попович", "Поприч", "Потравич", "Рудич", "Рурич", "Скибич",
                "Тулейбич", "Шуфрич", "Ягнич", "Ярич; Андрухович", "Анкудович", "Давидович", "Денькович", "Карпович",
                "Коріатович", "Коцюбович", "Лазарович", "Матусевич", "Мацієвич", "Нарушевич", "Сакевич", "Сахнович",
                "Сенатович", "Станкович", "Суранович", "Тобілевич", "Чуревич", "Шухевич", "Юркевич", "Барило", "Бурмило",
                "Ворошило", "Врюкало", "Гирило", "Госедло", "Качало", "Колотило", "Косило", "Країло", "Мазило", "Мерцало",
                "Покотило", "Політило", "Пухкало", "Ружило", "Садло", "Смачило", "Смикало", "Стукало", "Трясило", "Цекало",
                "Цюпило", "Шумило", "Юрчило"};
        Person person;
        if(Math.random()*10 < 5 ) {
            person = new Teacher(nameM[random.nextInt(nameM.length)], nameS[random.nextInt(nameM.length)]);
        } else {
            person = new Teacher(nameF[random.nextInt(nameM.length)], nameS[random.nextInt(nameM.length)]);
        }

        return person;
    }
}
